In [4]:
import numpy as np
import pandas as pd

In [5]:
workdir = '/Users/pnorton/Projects/Streamflow_CONUS/datapull_CONUS_daily_20210208'

stnfile = f'{workdir}/conus_daily_HUC_19_stn'

In [12]:
stn_col_names = ['site_no', 'station_nm', 'dec_lat_va', 'dec_long_va',
                 'drain_area_va',
                 # 'coord_datum_cd', 'alt_va', 'huc_cd', 'drain_area_va',
                 'contrib_drain_area_va']
stn_col_types = [np.str_, np.str_, np.float_, np.float_, np.float_, np.float_]
# stn_col_types = [np.str_, np.str_, np.float_, np.float_, np.str_, np.float_,
#                  np.str_, np.float_, np.float_]
stn_cols = dict(zip(stn_col_names, stn_col_types))

stations = pd.read_csv(stnfile, sep='\t', usecols=stn_col_names, dtype=np.str_)

In [13]:
stations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 535 entries, 0 to 534
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   site_no                535 non-null    object
 1   station_nm             535 non-null    object
 2   dec_lat_va             535 non-null    object
 3   dec_long_va            535 non-null    object
 4   drain_area_va          494 non-null    object
 5   contrib_drain_area_va  2 non-null      object
dtypes: object(6)
memory usage: 25.2+ KB

In [14]:
for dd in stations.columns:
    if stn_cols[dd] == np.float_:
#         stations[dd] = stations[dd].convert_objects(convert_numeric='force')
        stations[dd] = pd.to_numeric(stations[dd], errors='coerce', downcast='float')

In [15]:
stations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 535 entries, 0 to 534
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   site_no                535 non-null    object
 1   station_nm             535 non-null    object
 2   dec_lat_va             535 non-null    float32
 3   dec_long_va            535 non-null    float32
 4   drain_area_va          494 non-null    float32
 5   contrib_drain_area_va  2 non-null      float32
dtypes: float32(4), object(2)
memory usage: 16.8+ KB

In [17]:
stations.head(1000)

,site_no,station_nm,dec_lat_va,dec_long_va,drain_area_va,contrib_drain_area_va
0,15008000,SALMON R NR HYDER AK,56.025814,-130.066986,107.000000,NaN
1,15009000,SOULE R NR HYDER AK,55.833027,-130.183365,77.300003,NaN
2,15010000,DAVIS R NR HYDER AK,55.749695,-130.201706,78.699997,NaN
3,15011500,RED R NR METLAKATLA AK,55.141056,-130.532242,45.299999,NaN
4,15011870,WHITE C NR KETCHIKAN AK,55.413841,-130.462250,2.700000,NaN
...,...,...,...,...,...,...
530,654022149035900,HESS C AB FISH C NR LIVENGOOD AK,65.672333,-149.068924,NaN,NaN
531,671529150110500,SLATE C NR WISEMAN AK,67.257622,-150.187454,NaN,NaN
532,675538149511100,KUYUKTUVUK C 1MI AB DIETRICH R NR WISEMAN AK,67.926819,-149.855835,NaN,NaN
533,680355165294500,KISIMILOK C NR KIVALINA,68.064575,-165.498795,NaN,NaN
534,680630165510000,NASORAK C NR PT HOPE AK,68.107620,-165.852966,NaN,NaN

In [19]:
a = '1959-01-01'
a[0:7]

'1959-01'